# TextLabelType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayDiagramSettings..::..TextLabelType Property
AnalysisDisplayDiagramSettings Class See Also
---
Type of diagram text label visualization.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public AnalysisDisplayStyleDiagramTextLabelType TextLabelType { get; set; }
```

Visual Basic
---
```text
Public Property TextLabelType As AnalysisDisplayStyleDiagramTextLabelType
	Get
	Set
```

Visual C++
---
```text
public:
property AnalysisDisplayStyleDiagramTextLabelType TextLabelType {
	AnalysisDisplayStyleDiagramTextLabelType get ();
	void set (AnalysisDisplayStyleDiagramTextLabelType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
AnalysisDisplayDiagramSettings Class
Autodesk.Revit.DB.Analysis Namespace